In [1]:
%load_ext sql
%sql sqlite://

'Connected: @None'

# Numerical Expressions

Numerical expressions in SQL are similar to numerical expressions in Python. 

Expressions can contain function calls and arithmetic operators (e.g. `+`, `-`). 

Recall the format of `select` statement,

In [ ]:
select [columns] from [table] where [expression] order by [expression];

This can occur in any `[expression]` within `select` statement. Even the `[columns]` description contain `[expression]` as well. 

<img src = 'expression.png' width = 600/>

In any of these `[expression]`, we can:

**1.** Combine values: `+`, `-`, `*`, `/`, `%`, `and`, `or`

**2.** Transform values: `abs`, `round`, `not`, `-`,

**3.** Compare values: `<`, `<=`, `>`, `>=`, `<>`, `!=`, `=`

Both `<>` and `!=` means inequality. Equality is expressed with `=`.

## Demo

Let's say we have a table of `cities` as the following,

In [2]:
%%sql
create table cities as
    select 38 as latitude, 122 as longitude, "Berkeley" as name union
    select 42, 71, "Cambridge" union
    select 45, 93, "Minneapolis" union
    select 33, 117, "San Diego" union
    select 26, 80, "Miami" union
    select 90, 0, "North Pole";

 * sqlite://
Done.

[]

Now let's create a table named `cold`, where it contains the `name` of cold places (`latitude` of 43 or greater).

In [3]:
%%sql
create table cold as
    select name from cities where latitude >= 43;

 * sqlite://
Done.

[]

In [4]:
%%sql
select name from cold;

 * sqlite://
Done.

[('Minneapolis',), ('North Pole',)]

When we want to display the `name`s from the `cold` table, we see that it contains the expected cities: Minneapolis and North Pole. It turns out that we can modify this output! For example, if we want to add `"Chicago"` to this output, we can do the following,

In [5]:
%%sql
select name from cold union
select "Chicago";

 * sqlite://
Done.

[('Chicago',), ('Minneapolis',), ('North Pole',)]

Note that the `cold` table is unchanged!

In [6]:
%%sql
select * from cold;

 * sqlite://
Done.

[('Minneapolis',), ('North Pole',)]

Now for arithmetic operations, let's say we want to compute the North-South distance between cities. We measure the distance using "nautical mile", where 1 degree of latitude counts for 60 nautical miles.

In [3]:
%%sql
create table distances as
    select a.name as start, b.name as destination, 60 * (b.latitude - a.latitude) as distance
    from cities as a, cities as b;

 * sqlite://
Done.

[]

In [4]:
%%sql
select * from distances;

 * sqlite://
Done.

[('Miami', 'San Diego', 420),
 ('Miami', 'Berkeley', 720),
 ('Miami', 'Cambridge', 960),
 ('Miami', 'Minneapolis', 1140),
 ('Miami', 'North Pole', 3840),
 ('San Diego', 'Miami', -420),
 ('San Diego', 'Berkeley', 300),
 ('San Diego', 'Cambridge', 540),
 ('San Diego', 'Minneapolis', 720),
 ('San Diego', 'North Pole', 3420),
 ('Berkeley', 'Miami', -720),
 ('Berkeley', 'San Diego', -300),
 ('Berkeley', 'Cambridge', 240),
 ('Berkeley', 'Minneapolis', 420),
 ('Berkeley', 'North Pole', 3120),
 ('Cambridge', 'Miami', -960),
 ('Cambridge', 'San Diego', -540),
 ('Cambridge', 'Berkeley', -240),
 ('Cambridge', 'Minneapolis', 180),
 ('Cambridge', 'North Pole', 2880),
 ('Minneapolis', 'Miami', -1140),
 ('Minneapolis', 'San Diego', -720),
 ('Minneapolis', 'Berkeley', -420),
 ('Minneapolis', 'Cambridge', -180),
 ('Minneapolis', 'North Pole', 2700),
 ('North Pole', 'Miami', -3840),
 ('North Pole', 'San Diego', -3420),
 ('North Pole', 'Berkeley', -3120),
 ('North Pole', 'Cambridge', -2880),
 ('North Pole', 'Minneapolis', -2700)]